def fun(a,b,c):             # a,b,c在函数的定义处，所以是形式参数
    print("a=",a)
    print("b=",b)
    print("c=",c)


fun(10,20,30)       # 位置传参
lst= [11,22,33]
fun(*lst)             # 在函数调用时，将列表中的每个元素都转换为位置实参传入

print("-------------------------------")
fun(a=100,c=300,b=200)          # 关键字传参
dic={"a":111,"b":222,"c":333}
fun(**dic)             # 在函数的调用时，将字典中的键值对都转换为关键字实参传入


"""需求：c和d必须用关键字传参"""
def fun2(a,b,*,c,d):              # 从*之后的参数，在函数调用时，只能采用关键字参数传递
    print(a,b,c,d)

fun2(10,50,c=20,d=1000)


"""函数定义时的形参的顺序问题"""
def fun3(a,b,*c,d,**args):
    pass